{"timestamp":"2026-02-20T01:15:00Z","source_session_id":"e8f3b2a7-5d1c-4e9f-a6b8-2c4d7f9e1a3b","items":[{"type":"gap","card":null,"dimension":"HOW","severity":"high","description":"MI posture sequence framework (Engaging/Focusing/Evoking/Planning) is the structural foundation of the campfire conversation (D5 resolution) but exists nowhere in the library. Only found in issue #593 comments and provenance log.","suggested_action":"create_card","detail":"Create a new card or add a major HOW section to Component - Campfire documenting the MI posture sequence, OARS moves, Me/You/Us relational arc, and stage-matched pacing. This is the most critical gap for prompt writing -- without it, the prompt writer must reconstruct the framework from issue comments."},{"type":"gap","card":null,"dimension":"WHAT","severity":"high","description":"6-field campfire scorecard schema (startingState, heavyThing, firstProjectSeed, allianceAgreement, capacitySignals, valueSignals) is the primary output of the campfire conversation (D6 resolution) but is not documented in any library card.","suggested_action":"create_card","detail":"The scorecard schema should be documented in Component - Campfire or as a standalone artifact/standard. It defines the handoff contract between campfire and all downstream agents. All agents read this scorecard before their first interaction."},{"type":"gap","card":null,"dimension":"HOW","severity":"high","description":"Bordin Working Alliance exit criteria (goals, tasks, bond) determine when the campfire conversation can transition to the walk invitation. Not documented in any library card.","suggested_action":"improve_dimension","detail":"Add to Component - Campfire HOW section or Agent - Jarvis HOW section. These criteria are the prompt's success test for conversation completion."},{"type":"gap","card":null,"dimension":"WHY","severity":"medium","description":"Principle - Agreement Over Expectation is referenced in D5 and D6 resolutions as the governing principle for reflected extraction and the alliance agreement, but no such card exists in the library.","suggested_action":"create_card","detail":"Create Principle - Agreement Over Expectation in docs/context-library/rationale/principles/. This principle governs how Jarvis forms working agreements with builders -- through mutual conversation, not system defaults."},{"type":"weak_card","card":"Component - Campfire","dimension":"HOW","severity":"high","description":"The HOW section contains a rigid 8-step sequence that predates the D5 resolution (2026-02-18). It does not mention MI posture sequence, OARS, reflected extraction, scorecard, or Bordin exit criteria. The entire HOW section needs rewriting to reflect D5/D6.","suggested_action":"improve_dimension","detail":"Rewrite the HOW section to describe the MI posture sequence, OARS moves, reflected extraction mechanism, scorecard output, and how the walk invitation emerges from Bordin criteria. The existing 8-step sequence can be preserved as a simplified summary but should not be the primary structural description."},{"type":"weak_card","card":"Component - Campfire","dimension":"WHEN","severity":"high","description":"WHEN section was last updated 2026-02-12, before D5 (2026-02-18) and D6 (2026-02-18). No History entries for D5 or D6. Reality note is stale.","suggested_action":"improve_dimension","detail":"Add D5 and D6 History entries to the WHEN section. Update reality note to reference the resolved decisions."},{"type":"weak_card","card":"Release - The Campfire","dimension":"WHEN","severity":"high","description":"D5 and D6 are still presented as OPEN decision questions in the card body. Both were resolved 2026-02-18. The card body has not been updated with resolutions.","suggested_action":"improve_dimension","detail":"Add resolution blocks to D5 and D6 sections in the Release card matching the format of D1-D4 (which do have resolution blocks). This is the highest-priority staleness fix -- the Release card is the primary reference for build planning."},{"type":"weak_card","card":"Journey - Builder Onboarding","dimension":"WHEN","severity":"medium","description":"WHEN section was last updated 2026-02-12, before D5/D6. No History entries. The HOW phases table predates D5 but is broadly compatible. Missing explicit connection to MI posture sequence.","suggested_action":"improve_dimension","detail":"Add D5/D6 History entries. Note that The Meeting phase maps to MI Engaging and The Walk spans Focusing/Evoking/Planning."},{"type":"weak_card","card":"Agent - Jarvis","dimension":"WHEN","severity":"medium","description":"WHEN section still says 'Depends on campfire story decisions (D5) for initial prompt design' as if D5 is unresolved. D5 was resolved 2026-02-18.","suggested_action":"improve_dimension","detail":"Add D5 and D6 History entries. Update reality note to reflect that D5 and D6 are resolved and the campfire prompt design framework is now defined."},{"type":"weak_card","card":"Principle - First 72 Hours","dimension":"HOW","severity":"medium","description":"Day 1 goals still say 'Warm greeting at Campfire (Mesa)'. D5 resolved: Jarvis conducts onboarding, not Mesa.","suggested_action":"improve_dimension","detail":"Change 'Mesa' to 'Jarvis' in Day 1 goals. Mesa is reserve status (D4 resolution). Jarvis is the first steward the builder meets."},{"type":"weak_card","card":"Standard - Onboarding Sequence","dimension":"HOW","severity":"medium","description":"Day 1 table still says Actor is 'Mesa at Campfire' for warm greeting step. D5 resolved: Jarvis conducts onboarding.","suggested_action":"improve_dimension","detail":"Change 'Mesa at Campfire' to 'Jarvis at Campfire' in Day 1 step table. Update related conformance tests."},{"type":"weak_card","card":"System - Onboarding","dimension":"WHERE","severity":"medium","description":"WHERE section lists 'Agent - Mesa (first contact)'. D5 resolved: Jarvis is first contact. Mesa is reserve status.","suggested_action":"improve_dimension","detail":"Change Agent - Mesa (first contact) to Agent - Jarvis (first contact) in the WHERE section. Update transition table similarly."},{"type":"relationship_discovery","card":"Agent - Jarvis","dimension":"WHERE","severity":"low","description":"Agent - Jarvis card does not reference Component - Campfire in its WHERE section, despite the campfire being the first place Jarvis appears. The card only lists Room - Council Chamber as home.","suggested_action":"add_link","detail":"Add '[[Component - Campfire]] -- conducts onboarding conversation' to Agent - Jarvis WHERE section."},{"type":"relationship_discovery","card":"Component - Campfire","dimension":"WHERE","severity":"low","description":"Component - Campfire does not reference the scorecard output or the downstream consumers (Agent - Marvin, Agent - Conan, etc.) who read the scorecard.","suggested_action":"add_link","detail":"Add scorecard output and downstream consumer links to Component - Campfire WHERE section once the scorecard schema is documented."}]}
